# GIT - распределенная система контроля версий. 
# SKV(система контроля версий) - система для отслеживания и ведения истории изменения файлов, в вашем проекте. При помощи распрееленности git еще и организовывается командная работа.

# Репозиторий - это хранилище вашего кода и истории его изменений

# GitHub - вебсайт для размещения git-репозиториев в совместной разработке проектов

# Команды GIT:

# 1. git init - она создает новый локальный репо(репозиторий), в той директории в которой была прописана комнада. (Команда вводится 1 раз в начале)

# 2. git add - команда для добавления изменений в систему отслеживания гита.

# 3. git commit -m '<comment>' - это команда для сохранения всех изменений в локальном репозиториис комментарием к ним

# 4. git remote add <origin><url> '''origin git@github.com:VallaMorgulis/test.git''' - это команда для того, чтобы связать ваш локальный репо с удаленным репо в гитхабе.

# 5. git push <origin><master> '''origin master''' - команд отправки всех ваших изменений на удаленный репо



# git remote - проверяем связь

# git status - проверка статуса гита



